"""
------------------------------------------------------------------------------------------------------------------
                                            Семинар 6. Задача 32. Домашнее задание
Заполните массив элементами арифметической прогрессии. Её первый элемент a1 , разность d и количество элементов n 
будет задано автоматически. Формула для получения n-го члена прогрессии: an = a1 + (n-1) * d.
------------------------------------------------------------------------------------------------------------------
"""
# an = a1 + (n-1) * d
a1 = 2
d = 3
n = 4

# Введите ваше решение ниже
for i  in range(1, n+1):
    ai = a1 + (i-1)*d
    print(ai)


    