"""
------------------------------------------------------------------------------------------------------------------
                                            Семинар 2. Задача №14. Домашнее задание.
Требуется вывести все целые степени двойки (т.е. числа вида 2k), не превосходящие числа N.
------------------------------------------------------------------------------------------------------------------
"""
n=16

# Введите ваше решение ниже
power_of_two = 1
while power_of_two <= n:
    print(power_of_two)
    power_of_two *= 2