"""
------------------------------------------------------------------------------------------------------------------
                                            Семинар 3. Задача 16. Домашнее задание
Требуется вычислить, сколько раз встречается некоторое число k в массиве list_1.
Найдите количество и выведите его.
------------------------------------------------------------------------------------------------------------------
"""
list_1 = [1, 2, 3, 4, 5, 5, 3, 2, 3]
k = 3

# Введите ваше решение ниже
print(list_1.count(k))