"""
------------------------------------------------------------------------------------------------------------------
                                            Семинар 4. Задача 24.
Напишите программу, которая принимает на вход строку, и отслеживает, сколько раз каждый символ
уже встречался. Количество повторов добавляется к символам с помощью постфикса формата _n
------------------------------------------------------------------------------------------------------------------
"""
input = "a a a b c a a d c d d"

lst = input.split()
dct = {}
for item in lst:
    if item in dct:
        print(f'{item}_{dct[item]}', end=' ')
    else: (print(f"{item}", end=' '))
    dct[item]= dct.get(item, 0) + 1